app/Helpers/lapor_helper.php

function role($id)
{
    $db      = \Config\Database::connect();
    $builder = $db->table('auth_groups_users');
    $builder->select('*');
    $builder->join('auth_groups_permissions', 'auth_groups_permissions.group_id = auth_groups_users.group_id');
    $builder->join('auth_permissions', 'auth_permissions.id = auth_groups_permissions.permission_id');
    $builder->where('user_id', $id);
    $result = $builder->get()->getRow();
---
SELECT *
FROM `auth_groups_users`
JOIN `auth_groups_permissions` ON `auth_groups_permissions`.`group_id` = `auth_groups_users`.`group_id`
JOIN `auth_permissions` ON `auth_permissions`.`id` = `auth_groups_permissions`.`permission_id`
WHERE `user_id` = '86'

function get_info($id)
{
    $db      = \Config\Database::connect();
    $result = $db->table('users')->where('id', $id)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `id` = '0'

function get_jurusan($id)
{
    $db      = \Config\Database::connect();
    $result = $db->table('tbjurusan')->where('kode', $id)->get()->getRow();
---
SELECT *
FROM `tbjurusan`
WHERE `kode` = 'J7'

function jml_laporan()
{
    $db      = \Config\Database::connect();
    $result = $db->table('tbreport')->select("count(noref) as jml")->get()->getRow()->jml;
---
SELECT count(noref) as jml
FROM `tbreport`

function jml_tanggapan($noref)
{
    $db      = \Config\Database::connect();
    $result = $db->table('tbreport_d')->select("ifnull(count(noref),0) as jml")->where('noref',$noref)->get()->getRow()->jml;
---
SELECT ifnull(count(noref), 0) as jml
FROM `tbreport_d`
WHERE `noref` = '2023060002'

function jurusan()
{
    $db      = \Config\Database::connect();
    $id =  user_id();
    $builder = $db->table('auth_groups_users');
    $builder->select('*');
    $builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
    $builder->where('user_id', $id);
    $result = $builder->get()->getRow();
---
SELECT *
FROM `auth_groups_users`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `user_id` = '101'