app/Controllers/Admin.php

SELECT *
FROM `auth_logins`
ORDER BY `date` DESC
 LIMIT 20
---
    public function index()
    {
        $this->builder = $this->db->table('auth_logins');
        $this->builder->select('*');
        $this->builder->limit(20);
        $this->builder->orderBy('date', 'DESC');
        $result = $this->builder->get()->getResult();

SELECT *
FROM `users`
LEFT JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
ORDER BY `id` DESC
SELECT *
FROM `auth_groups`
---
    public function user()
    {
        $this->builder = $this->db->table('users');
        $this->builder->select('*');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id', 'left');
        $this->builder->orderBy('id', 'DESC');
        $result = $this->builder->get()->getResult();

        $this->builder = $this->db->table('auth_groups');
        $this->builder->select('*');
        $group_all = $this->builder->get()->getResult();

SELECT *
FROM `users`
WHERE `id` = '86'
---
    public function active_user($id)
    {
        $data = [
            'active' => 1,
            'updated_at' => $this->time
        ];
        $result = $this->db->table('users')->where('id', $id)->get()->getRow();

SELECT *
FROM `auth_groups`
ORDER BY `id` DESC
SELECT *
FROM `auth_permissions`
ORDER BY `id` DESC
SELECT `auth_groups`.`name` as `gn`, `auth_permissions`.`name` as `pn`, `group_id`, `permission_id`
FROM `auth_groups_permissions`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_permissions`.`group_id`
JOIN `auth_permissions` ON `auth_permissions`.`id` = `auth_groups_permissions`.`permission_id`
ORDER BY `group_id` ASC
---
    public function role()
    {
        $this->builder = $this->db->table('auth_groups');
        $this->builder->select('*');
        $this->builder->orderBy('id', 'DESC');
        $group_all = $this->builder->get()->getResult();

        $this->builder = $this->db->table('auth_permissions');
        $this->builder->select('*');
        $this->builder->orderBy('id', 'DESC');
        $perm_all = $this->builder->get()->getResult();
        $this->builder = $this->db->table('auth_groups_permissions');
        $this->builder->select('auth_groups.name as gn,auth_permissions.name as pn,group_id,permission_id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_permissions.group_id');
        $this->builder->join('auth_permissions', 'auth_permissions.id = auth_groups_permissions.permission_id');
        $this->builder->orderBy('group_id', 'ASC');
        $group = $this->builder->get()->getResult();