app/Controllers/Home.php

    public function index()
    {
        $tujuan = $this->db->table('tbjurusan')->get()->getResult();
---
SELECT *
FROM `tbjurusan`