app/Controllers/Lapor.php

SELECT *
FROM `tbreport`
WHERE `user_id` = '91'
---
    public function data()
    {
        $result = $this->db->table('tbreport')
            ->where('user_id', user_id())
            ->get()->getResult();

SELECT *
FROM `tbreport`
WHERE `tujuan` = 'J7'
---
    public function data_admin()
    {
        $result = $this->db->table('tbreport')
            ->where('tujuan', jurusan())
            ->get()->getResult();

SELECT *
FROM `tbreport` `r`
WHERE `r`.`noref` = '2023060002'
UPDATE `tbreport` SET `sts` = 1
WHERE `noref` = '2023060002'
SELECT *
FROM `tbreport_d` `r`
WHERE `r`.`noref` = '2023060002'
ORDER BY `urut` ASC
---
    public function show_admin($noref)
    {
        $result = $this->db->table('tbreport r')
            ->where('r.noref', $noref)
            ->get()->getRow();
        $this->db->table('tbreport')->where('noref', $noref)->update(['sts' => 1]);
        $result2 = $this->db->table('tbreport_d r')
            ->where('r.noref', $noref)
            ->orderBy('urut', 'ASC')
            ->get()->getResult();

SELECT *
FROM `tbreport_d`
WHERE `noref` = '2023060008'
ORDER BY `urut` DESC
INSERT INTO `tbreport_d` (`noref`, `urut`, `isi`, `user_id`, `tgl`, `inputby`) VALUES ('2023060008', 2, 'Baik Terimakasih', '91', '2023-06-15 23:15:03', '2023-06-15 23:15:03;91')
---
    public function feedback()
    {
        $noref = $this->request->getVar('noref');
        $urut = $this->db->table('tbreport_d')->where('noref', $noref)->orderBy('urut', 'DESC')->get()->getRow();
        if ($urut) {
            $urut = $urut->urut + 1;
        } else {
            $urut = 1;
        }
        $data = [
            'noref' => $noref,
            'urut' => $urut,
            'isi' => $this->request->getVar('isi'),
            'user_id' => user_id(),
            'tgl' => $this->time,
            'inputby' => $this->time . ';' . user_id()
        ];
        $this->db->table('tbreport_d')->where('noref', $noref)->insert($data);

SELECT *
FROM `tbreport`
ORDER BY `noref` DESC
---
    public function store()
    {
        $anonim = $this->request->getVar('anonim');
        if (logged_in() || $anonim == "on") {
            if ($anonim) {
                $user_id = 0;
                $anonim = 1;
            } else {
                $user_id = user()->id;
                $anonim = 0;
            }
            $cek = $this->db->table('tbreport')->orderBy('noref', 'DESC')->get()->getRow();

INSERT INTO `tbreport` (`noref`, `judul`, `user_id`, `lokasi`, `isi`, `tgl`, `tujuan`, `foto`, `inputby`) VALUES ('2023060008', 'Temuan Sampah', '91', 'Halaman Kampus', 'Sampah Berserakan', '2023-06-15', 'J1', '2023060008.png', '2023-06-15 23:12:42;User Agroindustri')
---
                'foto' => $namaFoto,
                'inputby' => gettime(),
            ];
            $this->db->table('tbreport')->insert($data);

SELECT *
FROM `tbjurusan`
---
    public function laporan()
    {
        $tujuan = $this->db->table('tbjurusan')->get()->getResult();