app/Controllers/User.php

SELECT `users`.`id` as `userid`, `username`, `email`, `image`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = '89'
---
    public function index()
    {
        $id = user_id();
        $this->builder = $this->db->table('users');
        $this->builder->select('users.id as userid,username,email,image');
        $this->builder->where('users.id', $id);
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $query = $this->builder->get();